notes/meeting_2021aug29.org
* meeting notes August 29, 2021
** before I forget
*** the argument to round might be called "nearest"
"round off to the nearest"

** multiple dispatch

Larry Wall on Raku:

"We don't actually have types for the benefit of strong typing.
That's third place.  Second place is we can optimize better.  But
first place is actually it's there for multiple dispatch."

   -- Erlang & Elixir Factory, 2017

