notes/meeting_2021aug29.md
- [meeting notes August 29, 2021](#org8dcf1c7)
  - [before I forget](#org0c76408)
    - [the argument to round might be called "nearest"](#org0d2834c)
  - [multiple dispatch](#orgdfb1b44)


<a id="org8dcf1c7"></a>

# meeting notes August 29, 2021


<a id="org0c76408"></a>

## before I forget


<a id="org0d2834c"></a>

### the argument to round might be called "nearest"

"round off to the nearest"


<a id="orgdfb1b44"></a>

## multiple dispatch

Larry Wall on Raku:

"We don't actually have types for the benefit of strong typing. That's third place. Second place is we can optimize better. But first place is actually it's there for multiple dispatch."

&#x2013; Erlang & Elixir Factory, 2017
